In [4]:
import pandas as pd

## __Ques 1__
1. __head(n=5):__ -> It shows the top n rows of data set , default value is 5. we can use this when we have to see top n rows of data only
2. __tail(n=5):__ ->  It shows the bottom n rows of data set , default value is 5. we can use this when we have to see bottom n rows of data only.
3. __sort_values(coloumn_name):__ -> it will return a sorted copy of the data frame. we can use this when we want to sort our column ex sorting based on names to give roll nmber in class
4. __drop():__ -> This function allows you to drop specific columns or rows from the DataFrame. For example, df.drop('column_name', axis=1) drops a column, and df.drop(0, axis=0) drops a row.
5. __apply():__ -> it will take each and every value of the series and apply a function on it and out put the result in the same order
6. __groupby():__ -> it if used in grouping the data and apply some function on that group and do teh calculation on that group
7. __describe():__ -> it will give statical calculation on the numeric coloumns

In [80]:
data = {
    'name': ['John', 'Sara', 'Tom', 'Mia', 'Bob'],
    'age': [25, 30, 18, 42, 50],
    'country': ['USA', 'Canada', 'Australia', 'USA', 'Mexico']
}

df = pd.DataFrame(data)
df

   name  age    country
0  John   25        USA
1  Sara   30     Canada
2   Tom   18  Australia
3   Mia   42        USA
4   Bob   50     Mexico

In [81]:
df.head(2)

   name  age country
0  John   25     USA
1  Sara   30  Canada

In [82]:
df.tail(2)

  name  age country
3  Mia   42     USA
4  Bob   50  Mexico

In [83]:
df.sort_values('name')

   name  age    country
4   Bob   50     Mexico
0  John   25        USA
3   Mia   42        USA
1  Sara   30     Canada
2   Tom   18  Australia

In [85]:
df.drop(1,axis=0)

   name  age    country
0  John   25        USA
2   Tom   18  Australia
3   Mia   42        USA
4   Bob   50     Mexico

In [86]:
df['First-letter-of-name'] = df['name'].apply(lambda x : x[0])

In [87]:
df

   name  age    country First-letter-of-name
0  John   25        USA                    J
1  Sara   30     Canada                    S
2   Tom   18  Australia                    T
3   Mia   42        USA                    M
4   Bob   50     Mexico                    B

In [88]:
df.groupby('country').sum()

/tmp/ipykernel_120/3604367011.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('country').sum()

           age
country
Australia   18
Canada      30
Mexico      50
USA         67

## __Ques 2__

In [5]:
data = {
    'A': ['John', 'Sara', 'Tom', 'Mia', 'Bob'],
    'B': [25, 30, 18, 42, 50],
    'C': ['USA', 'Canada', 'Australia', 'USA', 'Mexico']
}

In [6]:
df = pd.DataFrame(data)
df

      A   B          C
0  John  25        USA
1  Sara  30     Canada
2   Tom  18  Australia
3   Mia  42        USA
4   Bob  50     Mexico

In [7]:
df['index'] = [i for i in range(1 , 2*len(df) + 1 , 2)]
df.set_index('index')

          A   B          C
index
1      John  25        USA
3      Sara  30     Canada
5       Tom  18  Australia
7       Mia  42        USA
9       Bob  50     Mexico

## __Ques 3__

In [8]:
data = {
    'Name': ['John', 'Sara', 'Tom', 'Mia', 'Bob'],
    'Values' : [10, 20, 30, 40, 50],
}

In [9]:
df1 = pd.DataFrame(data)

In [13]:
def func(df , col , n=3):
    ans = 0
    for i in range(n):
        ans += df[col][i]
    print(ans)

In [14]:
func(df1,'Values')

60

## __Ques 4__

In [22]:
data = {
    "q4" : 'Given a Pandas DataFrame df with a column "Text", write a Python function to create a new column Word_Count that contains the number of words in each row of the Text column.'
}

In [24]:
df2 = pd.DataFrame(data , index=[0])

In [25]:
df2

                                                  q4
0  Given a Pandas DataFrame df with a column "Tex...

In [27]:
df2['Word-Count'] = df2['q4'].apply(lambda x : len(x.split()))

In [28]:
df2

                                                  q4  Word-Count
0  Given a Pandas DataFrame df with a column "Tex...          32

## __Ques 5__
1. __shape:__ Return a tuple representing the dimensionality of the DataFrame.
2. __size:__ Return an int representing the number of elements in this object. Return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.

In [29]:
df

      A   B          C  index
0  John  25        USA      1
1  Sara  30     Canada      3
2   Tom  18  Australia      5
3   Mia  42        USA      7
4   Bob  50     Mexico      9

In [33]:
# 5 rows and 4 cols
df.shape

(5, 4)

In [35]:
# 5 rows * 4 cols = 20 elements
df.size

20

## __Ques 6__
.read_excel() is used to read an excel file

In [37]:
# df = pd.read_excel('filename.xlsx')

## __Ques 7__

In [43]:
data = {
    'Email' : ['himanshu@gmail.com' , 'jhon@gmail.com' , 'sara@yahoo.com' , 'tom@hotmail.com']
}

In [44]:
df3 = pd.DataFrame(data)

In [45]:
df3

                Email
0  himanshu@gmail.com
1      jhon@gmail.com
2      sara@yahoo.com
3     tom@hotmail.com

In [46]:
df3['Username'] = df3['Email'].apply(lambda x : x[0:x.find('@')])

In [47]:
df3

                Email  Username
0  himanshu@gmail.com  himanshu
1      jhon@gmail.com      jhon
2      sara@yahoo.com      sara
3     tom@hotmail.com       tom

## __Ques 8__

In [49]:
data = {
    'A' : [3,8,6,2,9],
    'B' : [5,2,9,3,1],
    'C' : [1,7,4,5,2]
}

In [50]:
df4 = pd.DataFrame(data)

In [52]:
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [65]:
def func(df , col1 , col2 , n1=5 , n2=10):
    return df[df[df[col2] < n2][col1] > n1]

In [66]:
df5 = func(df4 , 'A' , 'B')

In [68]:
df5

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2